GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k42.inc
// Register: I2C2ADB1
#define I2C2ADB1 I2C2ADB1
I2C2ADB1                                 equ 03D58h
// bitfield definitions
I2C2ADB1_ADB_POSN                        equ 0000h
I2C2ADB1_ADB_POSITION                    equ 0000h
I2C2ADB1_ADB_SIZE                        equ 0008h
I2C2ADB1_ADB_LENGTH                      equ 0008h
I2C2ADB1_ADB_MASK                        equ 00FFh

// Register: I2C2ADR0
#define I2C2ADR0 I2C2ADR0
I2C2ADR0                                 equ 03D59h
// bitfield definitions
I2C2ADR0_ADR_POSN                        equ 0000h
I2C2ADR0_ADR_POSITION                    equ 0000h
I2C2ADR0_ADR_SIZE                        equ 0008h
I2C2ADR0_ADR_LENGTH                      equ 0008h
I2C2ADR0_ADR_MASK                        equ 00FFh

// Register: I2C2ADR1
#define I2C2ADR1 I2C2ADR1
I2C2ADR1                                 equ 03D5Ah
// bitfield definitions
I2C2ADR1_ADR_POSN                        equ 0001h
I2C2ADR1_ADR_POSITION                    equ 0001h
I2C2ADR1_ADR_SIZE                        equ 0007h
I2C2ADR1_ADR_LENGTH                      equ 0007h
I2C2ADR1_ADR_MASK                        equ 00FEh

// Register: I2C2ADR2
#define I2C2ADR2 I2C2ADR2
I2C2ADR2                                 equ 03D5Bh
// bitfield definitions
I2C2ADR2_ADR_POSN                        equ 0000h
I2C2ADR2_ADR_POSITION                    equ 0000h
I2C2ADR2_ADR_SIZE                        equ 0008h
I2C2ADR2_ADR_LENGTH                      equ 0008h
I2C2ADR2_ADR_MASK                        equ 00FFh

// Register: I2C2ADR3
#define I2C2ADR3 I2C2ADR3
I2C2ADR3                                 equ 03D5Ch
// bitfield definitions
I2C2ADR3_ADR_POSN                        equ 0001h
I2C2ADR3_ADR_POSITION                    equ 0001h
I2C2ADR3_ADR_SIZE                        equ 0007h
I2C2ADR3_ADR_LENGTH                      equ 0007h
I2C2ADR3_ADR_MASK                        equ 00FEh

// Register: I2C2CON0
#define I2C2CON0 I2C2CON0
I2C2CON0                                 equ 03D5Dh
// bitfield definitions
I2C2CON0_MODE_POSN                       equ 0000h
I2C2CON0_MODE_POSITION                   equ 0000h
I2C2CON0_MODE_SIZE                       equ 0003h
I2C2CON0_MODE_LENGTH                     equ 0003h
I2C2CON0_MODE_MASK                       equ 0007h
I2C2CON0_MDR_POSN                        equ 0003h
I2C2CON0_MDR_POSITION                    equ 0003h
I2C2CON0_MDR_SIZE                        equ 0001h
I2C2CON0_MDR_LENGTH                      equ 0001h
I2C2CON0_MDR_MASK                        equ 0008h
I2C2CON0_CSTR_POSN                       equ 0004h
I2C2CON0_CSTR_POSITION                   equ 0004h
I2C2CON0_CSTR_SIZE                       equ 0001h
I2C2CON0_CSTR_LENGTH                     equ 0001h
I2C2CON0_CSTR_MASK                       equ 0010h
I2C2CON0_S_POSN                          equ 0005h
I2C2CON0_S_POSITION                      equ 0005h
I2C2CON0_S_SIZE                          equ 0001h
I2C2CON0_S_LENGTH                        equ 0001h
I2C2CON0_S_MASK                          equ 0020h
I2C2CON0_RSEN_POSN                       equ 0006h
I2C2CON0_RSEN_POSITION                   equ 0006h
I2C2CON0_RSEN_SIZE                       equ 0001h
I2C2CON0_RSEN_LENGTH                     equ 0001h
I2C2CON0_RSEN_MASK                       equ 0040h
I2C2CON0_EN_POSN                         equ 0007h
I2C2CON0_EN_POSITION                     equ 0007h
I2C2CON0_EN_SIZE                         equ 0001h
I2C2CON0_EN_LENGTH                       equ 0001h
I2C2CON0_EN_MASK                         equ 0080h
I2C2CON0_MODE0_POSN                      equ 0000h
I2C2CON0_MODE0_POSITION                  equ 0000h
I2C2CON0_MODE0_SIZE                      equ 0001h
I2C2CON0_MODE0_LENGTH                    equ 0001h
I2C2CON0_MODE0_MASK                      equ 0001h
I2C2CON0_MODE1_POSN                      equ 0001h
I2C2CON0_MODE1_POSITION                  equ 0001h
I2C2CON0_MODE1_SIZE                      equ 0001h
I2C2CON0_MODE1_LENGTH                    equ 0001h
I2C2CON0_MODE1_MASK                      equ 0002h
I2C2CON0_MODE2_POSN                      equ 0002h
I2C2CON0_MODE2_POSITION                  equ 0002h
I2C2CON0_MODE2_SIZE                      equ 0001h
I2C2CON0_MODE2_LENGTH                    equ 0001h
I2C2CON0_MODE2_MASK                      equ 0004h
I2C2CON0_I2CEN_POSN                      equ 0007h
I2C2CON0_I2CEN_POSITION                  equ 0007h
I2C2CON0_I2CEN_SIZE                      equ 0001h
I2C2CON0_I2CEN_LENGTH                    equ 0001h
I2C2CON0_I2CEN_MASK                      equ 0080h

// Register: I2C2CON1
#define I2C2CON1 I2C2CON1
I2C2CON1                                 equ 03D5Eh
// bitfield definitions
I2C2CON1_CSD_POSN                        equ 0000h
I2C2CON1_CSD_POSITION                    equ 0000h
I2C2CON1_CSD_SIZE                        equ 0001h
I2C2CON1_CSD_LENGTH                      equ 0001h
I2C2CON1_CSD_MASK                        equ 0001h
I2C2CON1_TXU_POSN                        equ 0001h
I2C2CON1_TXU_POSITION                    equ 0001h
I2C2CON1_TXU_SIZE                        equ 0001h
I2C2CON1_TXU_LENGTH                      equ 0001h
I2C2CON1_TXU_MASK                        equ 0002h
I2C2CON1_RXO_POSN                        equ 0002h
I2C2CON1_RXO_POSITION                    equ 0002h
I2C2CON1_RXO_SIZE                        equ 0001h
I2C2CON1_RXO_LENGTH                      equ 0001h
I2C2CON1_RXO_MASK                        equ 0004h
I2C2CON1_ACKT_POSN                       equ 0004h
I2C2CON1_ACKT_POSITION                   equ 0004h
I2C2CON1_ACKT_SIZE                       equ 0001h
I2C2CON1_ACKT_LENGTH                     equ 0001h
I2C2CON1_ACKT_MASK                       equ 0010h
I2C2CON1_ACKSTAT_POSN                    equ 0005h
I2C2CON1_ACKSTAT_POSITION                equ 0005h
I2C2CON1_ACKSTAT_SIZE                    equ 0001h
I2C2CON1_ACKSTAT_LENGTH                  equ 0001h
I2C2CON1_ACKSTAT_MASK                    equ 0020h
I2C2CON1_ACKDT_POSN                      equ 0006h
I2C2CON1_ACKDT_POSITION                  equ 0006h
I2C2CON1_ACKDT_SIZE                      equ 0001h
I2C2CON1_ACKDT_LENGTH                    equ 0001h
I2C2CON1_ACKDT_MASK                      equ 0040h
I2C2CON1_ACKCNT_POSN                     equ 0007h
I2C2CON1_ACKCNT_POSITION                 equ 0007h
I2C2CON1_ACKCNT_SIZE                     equ 0001h
I2C2CON1_ACKCNT_LENGTH                   equ 0001h
I2C2CON1_ACKCNT_MASK                     equ 0080h

