GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k42.inc
// Register: U1ERRIR
#define U1ERRIR U1ERRIR
U1ERRIR                                  equ 03DF9h
// bitfield definitions
U1ERRIR_TXCIF_POSN                       equ 0000h
U1ERRIR_TXCIF_POSITION                   equ 0000h
U1ERRIR_TXCIF_SIZE                       equ 0001h
U1ERRIR_TXCIF_LENGTH                     equ 0001h
U1ERRIR_TXCIF_MASK                       equ 0001h
U1ERRIR_RXFOIF_POSN                      equ 0001h
U1ERRIR_RXFOIF_POSITION                  equ 0001h
U1ERRIR_RXFOIF_SIZE                      equ 0001h
U1ERRIR_RXFOIF_LENGTH                    equ 0001h
U1ERRIR_RXFOIF_MASK                      equ 0002h
U1ERRIR_RXBKIF_POSN                      equ 0002h
U1ERRIR_RXBKIF_POSITION                  equ 0002h
U1ERRIR_RXBKIF_SIZE                      equ 0001h
U1ERRIR_RXBKIF_LENGTH                    equ 0001h
U1ERRIR_RXBKIF_MASK                      equ 0004h
U1ERRIR_FERIF_POSN                       equ 0003h
U1ERRIR_FERIF_POSITION                   equ 0003h
U1ERRIR_FERIF_SIZE                       equ 0001h
U1ERRIR_FERIF_LENGTH                     equ 0001h
U1ERRIR_FERIF_MASK                       equ 0008h
U1ERRIR_CERIF_POSN                       equ 0004h
U1ERRIR_CERIF_POSITION                   equ 0004h
U1ERRIR_CERIF_SIZE                       equ 0001h
U1ERRIR_CERIF_LENGTH                     equ 0001h
U1ERRIR_CERIF_MASK                       equ 0010h
U1ERRIR_ABDOVF_POSN                      equ 0005h
U1ERRIR_ABDOVF_POSITION                  equ 0005h
U1ERRIR_ABDOVF_SIZE                      equ 0001h
U1ERRIR_ABDOVF_LENGTH                    equ 0001h
U1ERRIR_ABDOVF_MASK                      equ 0020h
U1ERRIR_PERIF_POSN                       equ 0006h
U1ERRIR_PERIF_POSITION                   equ 0006h
U1ERRIR_PERIF_SIZE                       equ 0001h
U1ERRIR_PERIF_LENGTH                     equ 0001h
U1ERRIR_PERIF_MASK                       equ 0040h
U1ERRIR_TXMTIF_POSN                      equ 0007h
U1ERRIR_TXMTIF_POSITION                  equ 0007h
U1ERRIR_TXMTIF_SIZE                      equ 0001h
U1ERRIR_TXMTIF_LENGTH                    equ 0001h
U1ERRIR_TXMTIF_MASK                      equ 0080h
U1ERRIR_U1TXCIF_POSN                     equ 0000h
U1ERRIR_U1TXCIF_POSITION                 equ 0000h
U1ERRIR_U1TXCIF_SIZE                     equ 0001h
U1ERRIR_U1TXCIF_LENGTH                   equ 0001h
U1ERRIR_U1TXCIF_MASK                     equ 0001h
U1ERRIR_U1RXFOIF_POSN                    equ 0001h
U1ERRIR_U1RXFOIF_POSITION                equ 0001h
U1ERRIR_U1RXFOIF_SIZE                    equ 0001h
U1ERRIR_U1RXFOIF_LENGTH                  equ 0001h
U1ERRIR_U1RXFOIF_MASK                    equ 0002h
U1ERRIR_U1RXBKIF_POSN                    equ 0002h
U1ERRIR_U1RXBKIF_POSITION                equ 0002h
U1ERRIR_U1RXBKIF_SIZE                    equ 0001h
U1ERRIR_U1RXBKIF_LENGTH                  equ 0001h
U1ERRIR_U1RXBKIF_MASK                    equ 0004h
U1ERRIR_U1FERIF_POSN                     equ 0003h
U1ERRIR_U1FERIF_POSITION                 equ 0003h
U1ERRIR_U1FERIF_SIZE                     equ 0001h
U1ERRIR_U1FERIF_LENGTH                   equ 0001h
U1ERRIR_U1FERIF_MASK                     equ 0008h
U1ERRIR_U1CERIF_POSN                     equ 0004h
U1ERRIR_U1CERIF_POSITION                 equ 0004h
U1ERRIR_U1CERIF_SIZE                     equ 0001h
U1ERRIR_U1CERIF_LENGTH                   equ 0001h
U1ERRIR_U1CERIF_MASK                     equ 0010h
U1ERRIR_U1ABDOVF_POSN                    equ 0005h
U1ERRIR_U1ABDOVF_POSITION                equ 0005h
U1ERRIR_U1ABDOVF_SIZE                    equ 0001h
U1ERRIR_U1ABDOVF_LENGTH                  equ 0001h
U1ERRIR_U1ABDOVF_MASK                    equ 0020h
U1ERRIR_U1PERIF_POSN                     equ 0006h
U1ERRIR_U1PERIF_POSITION                 equ 0006h
U1ERRIR_U1PERIF_SIZE                     equ 0001h
U1ERRIR_U1PERIF_LENGTH                   equ 0001h
U1ERRIR_U1PERIF_MASK                     equ 0040h
U1ERRIR_U1TXMTIF_POSN                    equ 0007h
U1ERRIR_U1TXMTIF_POSITION                equ 0007h
U1ERRIR_U1TXMTIF_SIZE                    equ 0001h
U1ERRIR_U1TXMTIF_LENGTH                  equ 0001h
U1ERRIR_U1TXMTIF_MASK                    equ 0080h

// Register: U1ERRIE
#define U1ERRIE U1ERRIE
U1ERRIE                                  equ 03DFAh
// bitfield definitions
U1ERRIE_TXCIE_POSN                       equ 0000h
U1ERRIE_TXCIE_POSITION                   equ 0000h
U1ERRIE_TXCIE_SIZE                       equ 0001h
U1ERRIE_TXCIE_LENGTH                     equ 0001h
U1ERRIE_TXCIE_MASK                       equ 0001h
U1ERRIE_RXFOIE_POSN                      equ 0001h
U1ERRIE_RXFOIE_POSITION                  equ 0001h
U1ERRIE_RXFOIE_SIZE                      equ 0001h
U1ERRIE_RXFOIE_LENGTH                    equ 0001h
U1ERRIE_RXFOIE_MASK                      equ 0002h
U1ERRIE_RXBKIE_POSN                      equ 0002h
U1ERRIE_RXBKIE_POSITION                  equ 0002h
U1ERRIE_RXBKIE_SIZE                      equ 0001h
U1ERRIE_RXBKIE_LENGTH                    equ 0001h
U1ERRIE_RXBKIE_MASK                      equ 0004h
U1ERRIE_FERIE_POSN                       equ 0003h
U1ERRIE_FERIE_POSITION                   equ 0003h
U1ERRIE_FERIE_SIZE                       equ 0001h
U1ERRIE_FERIE_LENGTH                     equ 0001h
U1ERRIE_FERIE_MASK                       equ 0008h
U1ERRIE_CERIE_POSN                       equ 0004h
U1ERRIE_CERIE_POSITION                   equ 0004h
U1ERRIE_CERIE_SIZE                       equ 0001h
U1ERRIE_CERIE_LENGTH                     equ 0001h
U1ERRIE_CERIE_MASK                       equ 0010h
U1ERRIE_ABDOVE_POSN                      equ 0005h
U1ERRIE_ABDOVE_POSITION                  equ 0005h
U1ERRIE_ABDOVE_SIZE                      equ 0001h
U1ERRIE_ABDOVE_LENGTH                    equ 0001h
U1ERRIE_ABDOVE_MASK                      equ 0020h
U1ERRIE_PERIE_POSN                       equ 0006h
U1ERRIE_PERIE_POSITION                   equ 0006h
U1ERRIE_PERIE_SIZE                       equ 0001h
U1ERRIE_PERIE_LENGTH                     equ 0001h
U1ERRIE_PERIE_MASK                       equ 0040h
U1ERRIE_TXMTIE_POSN                      equ 0007h
U1ERRIE_TXMTIE_POSITION                  equ 0007h
U1ERRIE_TXMTIE_SIZE                      equ 0001h
U1ERRIE_TXMTIE_LENGTH                    equ 0001h
U1ERRIE_TXMTIE_MASK                      equ 0080h
U1ERRIE_U1TXCIE_POSN                     equ 0000h
U1ERRIE_U1TXCIE_POSITION                 equ 0000h
U1ERRIE_U1TXCIE_SIZE                     equ 0001h
U1ERRIE_U1TXCIE_LENGTH                   equ 0001h
U1ERRIE_U1TXCIE_MASK                     equ 0001h
U1ERRIE_U1RXFOIE_POSN                    equ 0001h
U1ERRIE_U1RXFOIE_POSITION                equ 0001h
U1ERRIE_U1RXFOIE_SIZE                    equ 0001h
U1ERRIE_U1RXFOIE_LENGTH                  equ 0001h
U1ERRIE_U1RXFOIE_MASK                    equ 0002h
U1ERRIE_U1RXBKIE_POSN                    equ 0002h
U1ERRIE_U1RXBKIE_POSITION                equ 0002h
U1ERRIE_U1RXBKIE_SIZE                    equ 0001h
U1ERRIE_U1RXBKIE_LENGTH                  equ 0001h
U1ERRIE_U1RXBKIE_MASK                    equ 0004h
U1ERRIE_U1FERIE_POSN                     equ 0003h
U1ERRIE_U1FERIE_POSITION                 equ 0003h
U1ERRIE_U1FERIE_SIZE                     equ 0001h
U1ERRIE_U1FERIE_LENGTH                   equ 0001h
U1ERRIE_U1FERIE_MASK                     equ 0008h
U1ERRIE_U1CERIE_POSN                     equ 0004h
U1ERRIE_U1CERIE_POSITION                 equ 0004h
U1ERRIE_U1CERIE_SIZE                     equ 0001h
U1ERRIE_U1CERIE_LENGTH                   equ 0001h
U1ERRIE_U1CERIE_MASK                     equ 0010h
U1ERRIE_U1ABDOVE_POSN                    equ 0005h
U1ERRIE_U1ABDOVE_POSITION                equ 0005h
U1ERRIE_U1ABDOVE_SIZE                    equ 0001h
U1ERRIE_U1ABDOVE_LENGTH                  equ 0001h
U1ERRIE_U1ABDOVE_MASK                    equ 0020h
U1ERRIE_U1PERIE_POSN                     equ 0006h
U1ERRIE_U1PERIE_POSITION                 equ 0006h
U1ERRIE_U1PERIE_SIZE                     equ 0001h
U1ERRIE_U1PERIE_LENGTH                   equ 0001h
U1ERRIE_U1PERIE_MASK                     equ 0040h
U1ERRIE_U1TXMTIE_POSN                    equ 0007h
U1ERRIE_U1TXMTIE_POSITION                equ 0007h
U1ERRIE_U1TXMTIE_SIZE                    equ 0001h
U1ERRIE_U1TXMTIE_LENGTH                  equ 0001h
U1ERRIE_U1TXMTIE_MASK                    equ 0080h

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
DAC1CON1                                 equ 03E9Ch
// bitfield definitions
DAC1CON1_DATA_POSN                       equ 0000h
DAC1CON1_DATA_POSITION                   equ 0000h
DAC1CON1_DATA_SIZE                       equ 0005h
DAC1CON1_DATA_LENGTH                     equ 0005h
DAC1CON1_DATA_MASK                       equ 001Fh
DAC1CON1_DAC1R0_POSN                     equ 0000h
DAC1CON1_DAC1R0_POSITION                 equ 0000h
DAC1CON1_DAC1R0_SIZE                     equ 0001h
DAC1CON1_DAC1R0_LENGTH                   equ 0001h
DAC1CON1_DAC1R0_MASK                     equ 0001h
DAC1CON1_DAC1R1_POSN                     equ 0001h
DAC1CON1_DAC1R1_POSITION                 equ 0001h
DAC1CON1_DAC1R1_SIZE                     equ 0001h
DAC1CON1_DAC1R1_LENGTH                   equ 0001h
DAC1CON1_DAC1R1_MASK                     equ 0002h
DAC1CON1_DAC1R2_POSN                     equ 0002h
DAC1CON1_DAC1R2_POSITION                 equ 0002h
DAC1CON1_DAC1R2_SIZE                     equ 0001h
DAC1CON1_DAC1R2_LENGTH                   equ 0001h
DAC1CON1_DAC1R2_MASK                     equ 0004h
DAC1CON1_DAC1R3_POSN                     equ 0003h
DAC1CON1_DAC1R3_POSITION                 equ 0003h
DAC1CON1_DAC1R3_SIZE                     equ 0001h
DAC1CON1_DAC1R3_LENGTH                   equ 0001h
DAC1CON1_DAC1R3_MASK                     equ 0008h
DAC1CON1_DAC1R4_POSN                     equ 0004h
DAC1CON1_DAC1R4_POSITION                 equ 0004h
DAC1CON1_DAC1R4_SIZE                     equ 0001h
DAC1CON1_DAC1R4_LENGTH                   equ 0001h
DAC1CON1_DAC1R4_MASK                     equ 0010h
DAC1CON1_DAC1R_POSN                      equ 0000h
DAC1CON1_DAC1R_POSITION                  equ 0000h
DAC1CON1_DAC1R_SIZE                      equ 0005h
DAC1CON1_DAC1R_LENGTH                    equ 0005h
DAC1CON1_DAC1R_MASK                      equ 001Fh

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 03E9Eh
// bitfield definitions
DAC1CON0_NSS_POSN                        equ 0000h
DAC1CON0_NSS_POSITION                    equ 0000h
DAC1CON0_NSS_SIZE                        equ 0001h
DAC1CON0_NSS_LENGTH                      equ 0001h
DAC1CON0_NSS_MASK                        equ 0001h
DAC1CON0_PSS_POSN                        equ 0002h
DAC1CON0_PSS_POSITION                    equ 0002h
DAC1CON0_PSS_SIZE                        equ 0002h
DAC1CON0_PSS_LENGTH                      equ 0002h
DAC1CON0_PSS_MASK                        equ 000Ch
DAC1CON0_OE2_POSN                        equ 0004h
DAC1CON0_OE2_POSITION                    equ 0004h
DAC1CON0_OE2_SIZE                        equ 0001h
DAC1CON0_OE2_LENGTH                      equ 0001h
DAC1CON0_OE2_MASK                        equ 0010h
DAC1CON0_OE1_POSN                        equ 0005h
DAC1CON0_OE1_POSITION                    equ 0005h
DAC1CON0_OE1_SIZE                        equ 0001h
DAC1CON0_OE1_LENGTH                      equ 0001h
DAC1CON0_OE1_MASK                        equ 0020h
DAC1CON0_EN_POSN                         equ 0007h
DAC1CON0_EN_POSITION                     equ 0007h
DAC1CON0_EN_SIZE                         equ 0001h
DAC1CON0_EN_LENGTH                       equ 0001h
DAC1CON0_EN_MASK                         equ 0080h
DAC1CON0_DAC1NSS_POSN                    equ 0000h
DAC1CON0_DAC1NSS_POSITION                equ 0000h
DAC1CON0_DAC1NSS_SIZE                    equ 0001h
DAC1CON0_DAC1NSS_LENGTH                  equ 0001h
DAC1CON0_DAC1NSS_MASK                    equ 0001h
DAC1CON0_DAC1PSS0_POSN                   equ 0002h
DAC1CON0_DAC1PSS0_POSITION               equ 0002h
DAC1CON0_DAC1PSS0_SIZE                   equ 0001h
DAC1CON0_DAC1PSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS0_MASK                   equ 0004h
DAC1CON0_DAC1PSS1_POSN                   equ 0003h
DAC1CON0_DAC1PSS1_POSITION               equ 0003h
DAC1CON0_DAC1PSS1_SIZE                   equ 0001h
DAC1CON0_DAC1PSS1_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS1_MASK                   equ 0008h
DAC1CON0_DAC1OE2_POSN                    equ 0004h
DAC1CON0_DAC1OE2_POSITION                equ 0004h
DAC1CON0_DAC1OE2_SIZE                    equ 0001h
DAC1CON0_DAC1OE2_LENGTH                  equ 0001h
DAC1CON0_DAC1OE2_MASK                    equ 0010h
DAC1CON0_DAC1OE1_POSN                    equ 0005h
DAC1CON0_DAC1OE1_POSITION                equ 0005h
DAC1CON0_DAC1OE1_SIZE                    equ 0001h
DAC1CON0_DAC1OE1_LENGTH                  equ 0001h
DAC1CON0_DAC1OE1_MASK                    equ 0020h
DAC1CON0_DAC1EN_POSN                     equ 0007h
DAC1CON0_DAC1EN_POSITION                 equ 0007h
DAC1CON0_DAC1EN_SIZE                     equ 0001h
DAC1CON0_DAC1EN_LENGTH                   equ 0001h
DAC1CON0_DAC1EN_MASK                     equ 0080h
DAC1CON0_PSS0_POSN                       equ 0002h
DAC1CON0_PSS0_POSITION                   equ 0002h
DAC1CON0_PSS0_SIZE                       equ 0001h
DAC1CON0_PSS0_LENGTH                     equ 0001h
DAC1CON0_PSS0_MASK                       equ 0004h
DAC1CON0_PSS1_POSN                       equ 0003h
DAC1CON0_PSS1_POSITION                   equ 0003h
DAC1CON0_PSS1_SIZE                       equ 0001h
DAC1CON0_PSS1_LENGTH                     equ 0001h
DAC1CON0_PSS1_MASK                       equ 0008h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 03EB8h
// bitfield definitions
CM2CON0_SYNC_POSN                        equ 0000h
CM2CON0_SYNC_POSITION                    equ 0000h
CM2CON0_SYNC_SIZE                        equ 0001h
CM2CON0_SYNC_LENGTH                      equ 0001h
CM2CON0_SYNC_MASK                        equ 0001h
CM2CON0_HYS_POSN                         equ 0001h
CM2CON0_HYS_POSITION                     equ 0001h
CM2CON0_HYS_SIZE                         equ 0001h
CM2CON0_HYS_LENGTH                       equ 0001h
CM2CON0_HYS_MASK                         equ 0002h
CM2CON0_POL_POSN                         equ 0004h
CM2CON0_POL_POSITION                     equ 0004h
CM2CON0_POL_SIZE                         equ 0001h
CM2CON0_POL_LENGTH                       equ 0001h
CM2CON0_POL_MASK                         equ 0010h
CM2CON0_OUT_POSN                         equ 0006h
CM2CON0_OUT_POSITION                     equ 0006h
CM2CON0_OUT_SIZE                         equ 0001h
CM2CON0_OUT_LENGTH                       equ 0001h
CM2CON0_OUT_MASK                         equ 0040h
CM2CON0_EN_POSN                          equ 0007h
CM2CON0_EN_POSITION                      equ 0007h
CM2CON0_EN_SIZE                          equ 0001h
CM2CON0_EN_LENGTH                        equ 0001h
CM2CON0_EN_MASK                          equ 0080h
CM2CON0_C2SYNC_POSN                      equ 0000h
CM2CON0_C2SYNC_POSITION                  equ 0000h
CM2CON0_C2SYNC_SIZE                      equ 0001h
CM2CON0_C2SYNC_LENGTH                    equ 0001h
CM2CON0_C2SYNC_MASK                      equ 0001h
CM2CON0_C2HYS_POSN                       equ 0001h
CM2CON0_C2HYS_POSITION                   equ 0001h
CM2CON0_C2HYS_SIZE                       equ 0001h
CM2CON0_C2HYS_LENGTH                     equ 0001h
CM2CON0_C2HYS_MASK                       equ 0002h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2EN_POSN                        equ 0007h
CM2CON0_C2EN_POSITION                    equ 0007h
CM2CON0_C2EN_SIZE                        equ 0001h
CM2CON0_C2EN_LENGTH                      equ 0001h
CM2CON0_C2EN_MASK                        equ 0080h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 03EB9h
// bitfield definitions
CM2CON1_INTN_POSN                        equ 0000h
CM2CON1_INTN_POSITION                    equ 0000h
CM2CON1_INTN_SIZE                        equ 0001h
CM2CON1_INTN_LENGTH                      equ 0001h
CM2CON1_INTN_MASK                        equ 0001h
CM2CON1_INTP_POSN                        equ 0001h
CM2CON1_INTP_POSITION                    equ 0001h
CM2CON1_INTP_SIZE                        equ 0001h
CM2CON1_INTP_LENGTH                      equ 0001h
CM2CON1_INTP_MASK                        equ 0002h
CM2CON1_C2INTN_POSN                      equ 0000h
CM2CON1_C2INTN_POSITION                  equ 0000h
CM2CON1_C2INTN_SIZE                      equ 0001h
CM2CON1_C2INTN_LENGTH                    equ 0001h
CM2CON1_C2INTN_MASK                      equ 0001h
CM2CON1_C2INTP_POSN                      equ 0001h
CM2CON1_C2INTP_POSITION                  equ 0001h
CM2CON1_C2INTP_SIZE                      equ 0001h
CM2CON1_C2INTP_LENGTH                    equ 0001h
CM2CON1_C2INTP_MASK                      equ 0002h

// Register: CM2NCH
#define CM2NCH CM2NCH
CM2NCH                                   equ 03EBAh
// bitfield definitions
CM2NCH_NCH_POSN                          equ 0000h
CM2NCH_NCH_POSITION                      equ 0000h
CM2NCH_NCH_SIZE                          equ 0003h
CM2NCH_NCH_LENGTH                        equ 0003h
CM2NCH_NCH_MASK                          equ 0007h
CM2NCH_NCH0_POSN                         equ 0000h
CM2NCH_NCH0_POSITION                     equ 0000h
CM2NCH_NCH0_SIZE                         equ 0001h
CM2NCH_NCH0_LENGTH                       equ 0001h
CM2NCH_NCH0_MASK                         equ 0001h
CM2NCH_NCH1_POSN                         equ 0001h
CM2NCH_NCH1_POSITION                     equ 0001h
CM2NCH_NCH1_SIZE                         equ 0001h
CM2NCH_NCH1_LENGTH                       equ 0001h
CM2NCH_NCH1_MASK                         equ 0002h
CM2NCH_NCH2_POSN                         equ 0002h
CM2NCH_NCH2_POSITION                     equ 0002h
CM2NCH_NCH2_SIZE                         equ 0001h
CM2NCH_NCH2_LENGTH                       equ 0001h
CM2NCH_NCH2_MASK                         equ 0004h
CM2NCH_C2NCH0_POSN                       equ 0000h
CM2NCH_C2NCH0_POSITION                   equ 0000h
CM2NCH_C2NCH0_SIZE                       equ 0001h
CM2NCH_C2NCH0_LENGTH                     equ 0001h
CM2NCH_C2NCH0_MASK                       equ 0001h
CM2NCH_C2NCH1_POSN                       equ 0001h
CM2NCH_C2NCH1_POSITION                   equ 0001h
CM2NCH_C2NCH1_SIZE                       equ 0001h
CM2NCH_C2NCH1_LENGTH                     equ 0001h
CM2NCH_C2NCH1_MASK                       equ 0002h
CM2NCH_C2NCH2_POSN                       equ 0002h
CM2NCH_C2NCH2_POSITION                   equ 0002h
CM2NCH_C2NCH2_SIZE                       equ 0001h
CM2NCH_C2NCH2_LENGTH                     equ 0001h
CM2NCH_C2NCH2_MASK                       equ 0004h

