GopalSaraf/Practicals/PSDL/include/proc/pic18lf26k42.inc
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUC7                            BANKMASK(WPUC), 7, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WR                               BANKMASK(NVMCON1), 1, b
#define WR1IE                            BANKMASK(I2C1PIE), 4, b
#define WR1IF                            BANKMASK(I2C1PIR), 4, b
#define WR2IE                            BANKMASK(I2C2PIE), 4, b
#define WR2IF                            BANKMASK(I2C2PIR), 4, b
#define WREN                             BANKMASK(NVMCON1), 2, b
#define WRERR                            BANKMASK(NVMCON1), 3, b
#define WS                               BANKMASK(SMT1STAT), 1, b
#define WSEL0                            BANKMASK(SMT1WIN), 0, b
#define WSEL1                            BANKMASK(SMT1WIN), 1, b
#define WSEL2                            BANKMASK(SMT1WIN), 2, b
#define WSEL3                            BANKMASK(SMT1WIN), 3, b
#define WSEL4                            BANKMASK(SMT1WIN), 4, b
#define X1                               BANKMASK(CRCXORL), 1, b
#define X10                              BANKMASK(CRCXORH), 2, b
#define X11                              BANKMASK(CRCXORH), 3, b
#define X12                              BANKMASK(CRCXORH), 4, b
#define X13                              BANKMASK(CRCXORH), 5, b
#define X14                              BANKMASK(CRCXORH), 6, b
#define X15                              BANKMASK(CRCXORH), 7, b
#define X2                               BANKMASK(CRCXORL), 2, b
#define X3                               BANKMASK(CRCXORL), 3, b
#define X4                               BANKMASK(CRCXORL), 4, b
#define X5                               BANKMASK(CRCXORL), 5, b
#define X6                               BANKMASK(CRCXORL), 6, b
#define X7                               BANKMASK(CRCXORL), 7, b
#define X8                               BANKMASK(CRCXORH), 0, b
#define X9                               BANKMASK(CRCXORH), 1, b
#define ZCDIE                            BANKMASK(PIE1), 1, b
#define ZCDIF                            BANKMASK(PIR1), 1, b
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR1), 1, b
#define ZCDMD                            BANKMASK(PMD2), 0, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define ZERO                             BANKMASK(STATUS), 2, a
#define nBOR                             BANKMASK(PCON0), 0, a
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nWDTWV                           BANKMASK(PCON0), 5, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec,lowdata
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec,lowdata
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec,lowdata
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec,lowdata
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec,lowdata
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec,lowdata
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec,lowdata
psect udata_bank15,class=BANK15,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18LF26K42_INC_
